{
  "achievements_certifications": [
    {
      "name": "Topper of My Branch",
      "description": "I secured the highest academic rank in my branch with a CGPA of 8.95, maintaining excellent grades throughout my academic journey.",
      "skills": "Strong academic performance, problem-solving, consistency"
    },
    {
      "name": "Top 1% in NPTEL IIT Bombay Demystifying Networks Exam",
      "description": "Ranked among the top 1% in a national-level networking exam conducted by IIT Bombay, demonstrating strong technical and analytical skills.",
      "skills": "Computer networks, problem-solving, technical knowledge"
    },
    {
      "name": "CS50 Web Development Course Completion",
      "description": "Completed CS50 Web Development using Python and JavaScript and gained strong knowledge of HTML, CSS, JavaScript, Git, CI/CD principles, security, and Django.",
      "skills": "Web development, full-stack programming, problem-solving"
    },
    {
      "name": "GeeksforGeeks Coding Challenge Winner",
      "description": "Declared a winner of the GFG 160 Days Challenge for consistently solving problems, improving competitive programming and problem-solving skills.",
      "skills": "Competitive programming, consistency, data structures and algorithms"
    },
    {
      "name": "3rd Winner - 39th MPYSC Innovation Challenge",
      "description": "Won 3rd place for developing a Smart Home Automation project at the MP Young Scientist Congress, showcasing innovation and technical expertise.",
      "skills": "IoT, embedded systems, innovation, teamwork"
    }
  ],
  "leadership_activities": [
    {
      "name": "Competitive Programming Student Coordinator",
      "description": "Selected as the Competitive Programming Coordinator to guide students in problem-solving, organize coding sessions, and promote a coding culture.",
      "skills": "Leadership, mentoring, data structures and algorithms"
    },
    {
      "name": "Infosys Springboard Cohort 4 - Pragati Path to Future",
      "description": "Selected for Infosys Springboard Cohort 4 - Pragati Path to Future, a program focused on technical skill-building, career growth, and professional development.",
      "skills": "Soft skills, career development, technology fundamentals"
    },
    {
      "name": "Lead - GeeksforGeeks Student Chapter (MITS)",
      "description": "Leading the GeeksforGeeks Student Chapter at MITS, collaborating with peers to organize coding challenges and mentor students in problem-solving.",
      "skills": "Leadership, event management, teaching, problem-solving"
    },
    {
      "name": "Student Coordinator - Innovation & DIY Club",
      "description": "Guiding students in hands-on IoT projects at the Innovation & DIY Club, fostering technical skills and encouraging innovative thinking.",
      "skills": "IoT, embedded systems, project management, technical problem-solving"
    }
  ]
}
